In [6]:
import numpy as np

In [ ]:
arr=np.array([1,2,3,4,5])

In [ ]:
arr

In [ ]:
arr=np.array([1,2,3,4,5],dtype="float")
arr

In [ ]:
ar1=array((1,2,3,4,5))
ar1

# pandas
- it is imp module in data science libraries
- stands for panel data
- data structure
  - series
  - data frames
- with this we can do data analysis,manipulatiopns,cleaning
- data analysation
  - statistics  of the data
  - volume of the data
- data manuplation
  - changing data from one form to another 
  - merging and concatenation.....etc!
- data cleaning
  - deleting roll values and Nan values
  - removing unwanted data

In [8]:
import pandas as pd

In [ ]:
pd.__version__

In [ ]:
# we can create the pandas series with list,string,tuple

In [ ]:
print(dir(pd))

In [ ]:
a=pd.Series("i am from vr")
a

In [23]:
b=input()
c=pd.Series(b)
c

i am

0    i am
dtype: object

In [24]:
b=input().split()
c=pd.Series(b)
c

i am from vr

0       i
1      am
2    from
3      vr
dtype: object

In [28]:
t=(4,5,6,8,7)
t1=pd.Series(t)
t1

0    4
1    5
2    6
3    8
4    7
dtype: int64

In [29]:
li=[2,3,4,5,6]
li1=pd.Series(li)
li1

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [30]:
pd.Series(range(1,10))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [31]:
dicc={'list':[1,2,3],'tuple' : (1,2,3),'string' : '12345', 'int' : 7}
dicc

{'list': [1, 2, 3], 'tuple': (1, 2, 3), 'string': '12345', 'int': 7}

In [35]:
dic1=pd.Series(dicc)
dic1

list      [1, 2, 3]
tuple     (1, 2, 3)
string        12345
int               7
dtype: object

In [36]:
dic1.index

Index(['list', 'tuple', 'string', 'int'], dtype='object')

In [37]:
import numpy as np
a=np.arange(10,51,5)
print(a)

[10 15 20 25 30 35 40 45 50]

In [38]:
a1=pd.Series(a)
print(a1)

0    10
1    15
2    20
3    25
4    30
5    35
6    40
7    45
8    50
dtype: int32

In [39]:
len(a1)

9

In [41]:
a1[1]

15

In [42]:
a1[::-1]

8    50
7    45
6    40
5    35
4    30
3    25
2    20
1    15
0    10
dtype: int32

In [43]:
a1[len(a1)-1]

50

In [44]:
a1.index

RangeIndex(start=0, stop=9, step=1)

In [45]:
a1.index=[9,8,7,6,5,4,3,2,1]

In [46]:
a1

9    10
8    15
7    20
6    25
5    30
4    35
3    40
2    45
1    50
dtype: int32

In [47]:
l=["play","bold","virat","king"]
pd.Series(l,index=(1,3,5,7))

1     play
3     bold
5    virat
7     king
dtype: object

In [48]:
l=["play","bold","virat","king"]
ind=[i for i in range(15,19)]
pd.Series(ind)

0    15
1    16
2    17
3    18
dtype: int64

In [49]:
pd.Series(l)

0     play
1     bold
2    virat
3     king
dtype: object

In [50]:
dic2=pd.Series(dict,index=ind)

In [51]:
dic2

15    <class 'dict'>
16    <class 'dict'>
17    <class 'dict'>
18    <class 'dict'>
dtype: object

In [52]:
dic2.index

Int64Index([15, 16, 17, 18], dtype='int64')

In [9]:
dt=pd.date_range('2022-01-01','2022-01-15')
dt

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12',
               '2022-01-13', '2022-01-14', '2022-01-15'],
              dtype='datetime64[ns]', freq='D')

In [10]:
dt=pd.date_range('2022-01-01',periods=6)
dt

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
temp=[23,45,67,89,12,89]
dt1=pd.Series(temp,index=dt)
dt1

2022-01-01    23
2022-01-02    45
2022-01-03    67
2022-01-04    89
2022-01-05    12
2022-01-06    89
Freq: D, dtype: int64

In [13]:
dt1

2022-01-01    23
2022-01-02    45
2022-01-03    67
2022-01-04    89
2022-01-05    12
2022-01-06    89
Freq: D, dtype: int64

In [19]:
data=pd.read_csv("marks.csv")

In [20]:
data

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [21]:
data[['Roll','Name','Maths']]

   Roll Name  Maths
0    A1    X     60
1    A2    Y     90
2    A1    G     60
3    A2    H     40
4    B1    I     50
5    B2    J     63
6    C1    K     67
7    C2    L     91
8    D1    M     40
9    D2    N      5
10   E1    X     50
11   E2    Y     60

In [22]:
 new=pd.read_csv("marks.csv",usecol=['Name'])

TypeError: parser_f() got an unexpected keyword argument 'usecol'

In [23]:
data.CO.sum()

689.0

In [24]:
data.isnull()

     Roll   Name  Maths  Discrete     OS     CO     DS
0   False  False  False     False  False  False  False
1   False  False  False     False  False  False  False
2   False  False  False     False  False   True  False
3   False  False  False     False  False  False   True
4   False  False  False     False  False  False   True
5   False  False  False     False  False  False  False
6   False  False  False     False  False  False  False
7   False  False  False     False  False  False  False
8   False  False  False     False  False   True  False
9   False  False  False     False  False  False   True
10  False  False  False     False  False  False  False
11  False  False  False     False  False  False  False

In [ ]:
ff